app/controllers/host/spaces_controller.rb

INSERT INTO "spaces" ("host_id", "name", "address", "detail", "image_id", "capacity", "open_time", "close_time", "hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @space = Space.new(space_params)
    @space.host_id = current_host.id
    @space.save

SELECT "spaces".* FROM "spaces" WHERE "spaces"."host_id" = ?  [["host_id", 1]]
---
  def index
    @spaces = Space.all.where(host_id: current_host.id)

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @space = Space.find(params[:id])

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @space = Space.find(params[:id])