app/controllers/guest/spaces_controller.rb

SELECT "spaces".* FROM "spaces" WHERE "spaces"."is_active" = ?  [["is_active", 1]]
---
  def index
    @spaces = Space.where(is_active: true)

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @space = Space.find(params[:id])